Ran Plan for 2 projects:

1. dir: `infra/azure/terraform/k8s-infra-prow-build` workspace: `default`
1. dir: `infra/gcp/terraform/k8s-infra-prow-build` workspace: `default`
---

### 1. dir: `infra/azure/terraform/k8s-infra-prow-build` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform init -input=false -upgrade' in '/atlantis/repos/kubernetes/k8s.io/8911/default/infra/azure/terraform/k8s-infra-prow-build': exit status 1
Initializing the backend...
Upgrading modules...
Downloading registry.terraform.io/claranet/regions/azurerm 7.4.0 for azure_region...
- azure_region in .terraform/modules/azure_region
Downloading registry.terraform.io/Azure/naming/azurerm 0.4.1 for naming...
- naming in .terraform/modules/naming
Downloading registry.terraform.io/Azure/avm-ptn-network-private-link-private-dns-zones/azurerm 0.23.0 for private_dns_zones...
- private_dns_zones in .terraform/modules/private_dns_zones
Downloading registry.terraform.io/Azure/avm-utl-interfaces/azure 0.5.0 for private_dns_zones.avm_interfaces...
- private_dns_zones.avm_interfaces in .terraform/modules/private_dns_zones.avm_interfaces
Downloading registry.terraform.io/Azure/avm-res-network-privatednszone/azurerm 0.4.3 for private_dns_zones.avm_res_network_privatednszone...
- private_dns_zones.avm_res_network_privatednszone in .terraform/modules/private_dns_zones.avm_res_network_privatednszone
- private_dns_zones.avm_res_network_privatednszone.a_record in .terraform/modules/private_dns_zones.avm_res_network_privatednszone/modules/private_dns_a_record
- private_dns_zones.avm_res_network_privatednszone.aaaa_record in .terraform/modules/private_dns_zones.avm_res_network_privatednszone/modules/private_dns_aaaa_record
Downloading registry.terraform.io/Azure/avm-utl-interfaces/azure 0.2.0 for private_dns_zones.avm_res_network_privatednszone.avm_interfaces...
- private_dns_zones.avm_res_network_privatednszone.avm_interfaces in .terraform/modules/private_dns_zones.avm_res_network_privatednszone.avm_interfaces
- private_dns_zones.avm_res_network_privatednszone.cname_record in .terraform/modules/private_dns_zones.avm_res_network_privatednszone/modules/private_dns_cname_record
- private_dns_zones.avm_res_network_privatednszone.mx_record in .terraform/modules/private_dns_zones.avm_res_network_privatednszone/modules/private_dns_mx_record
- private_dns_zones.avm_res_network_privatednszone.ptr_record in .terraform/modules/private_dns_zones.avm_res_network_privatednszone/modules/private_dns_ptr_record
- private_dns_zones.avm_res_network_privatednszone.srv_record in .terraform/modules/private_dns_zones.avm_res_network_privatednszone/modules/private_dns_srv_record
- private_dns_zones.avm_res_network_privatednszone.txt_record in .terraform/modules/private_dns_zones.avm_res_network_privatednszone/modules/private_dns_txt_record
- private_dns_zones.avm_res_network_privatednszone.virtual_network_links in .terraform/modules/private_dns_zones.avm_res_network_privatednszone/modules/private_dns_virtual_network_link
Downloading registry.terraform.io/Azure/avm-utl-regions/azurerm 0.9.2 for private_dns_zones.regions...
- private_dns_zones.regions in .terraform/modules/private_dns_zones.regions
- private_dns_zones.regions.cached_data in .terraform/modules/private_dns_zones.regions/modules/cached-data
Downloading registry.terraform.io/Azure/aks/azurerm 10.0.0 for prow_build...
- prow_build in .terraform/modules/prow_build/v4
Downloading registry.terraform.io/Azure/avm-res-network-virtualnetwork/azurerm 0.16.0 for prow_network...
- prow_network in .terraform/modules/prow_network
- prow_network.peering in .terraform/modules/prow_network/modules/peering
- prow_network.subnet in .terraform/modules/prow_network/modules/subnet
╷
│ Error: unable to build authorizer for Resource Manager API: could not configure AzureCli Authorizer: could not parse Azure CLI version: launching Azure CLI: exec: "az": executable file not found in $PATH
│ 
│ 
╵

```
</details>

---
### 2. dir: `infra/gcp/terraform/k8s-infra-prow-build` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # google_iam_workload_identity_pool.aks_cluster will be created
+ resource "google_iam_workload_identity_pool" "aks_cluster" {
      + description               = "Identity pool for CI on Azure using AKS clusters"
      + display_name              = "AKS Prow Cluster"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "k8s-infra-prow-build"
      + state                     = (known after apply)
      + workload_identity_pool_id = "prow-aks"
    }

  # google_iam_workload_identity_pool_provider.aks_cluster will be created
+ resource "google_iam_workload_identity_pool_provider" "aks_cluster" {
      + attribute_mapping                  = {
          + "google.subject" = "assertion.sub"
        }
      + description                        = "Identity pool for CI on Azure using AKS clusters"
      + display_name                       = "AKS OIDC provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "k8s-infra-prow-build"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "prow-aks"
      + workload_identity_pool_provider_id = "oidc"

      + oidc {
          + allowed_audiences = [
              + "sts.googleapis.com",
            ]
          + issuer_uri        = "https://eastus2.oic.prod-aks.azure.com/d1aa7522-0959-442e-80ee-8c4f7fb4c184/85d5aa19-bc3c-4cdb-bc17-0cf8703cfa3f"
        }
    }

  # google_vmwareengine_network_peering.gvce_peering will be updated in-place
~ resource "google_vmwareengine_network_peering" "gvce_peering" {
      ~ export_custom_routes_with_public_ip = false -> true
        id                                  = "projects/k8s-infra-prow-build/locations/global/networkPeerings/peer-with-gcve-project"
      ~ import_custom_routes_with_public_ip = false -> true
        name                                = "peer-with-gcve-project"
        # (13 unchanged attributes hidden)
    }

  # module.iam.google_project_iam_binding.project_iam_authoritative["default--roles/secretmanager.secretAccessor"] will be updated in-place
~ resource "google_project_iam_binding" "project_iam_authoritative" {
        id      = "k8s-infra-prow-build/roles/secretmanager.secretAccessor"
      ~ members = [
          + "principal://iam.googleapis.com/projects/16065310909/locations/global/workloadIdentityPools/k8s-infra-prow.svc.id.goog/subject/ns/external-secrets/sa/external-secrets",
            # (3 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.workload_identity_service_accounts["kubernetes-external-secrets"].data.google_iam_policy.workload_identity will be read during apply
  # (config refers to values not yet known)
 <= data "google_iam_policy" "workload_identity" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + "principalSet://iam.googleapis.com/projects/773781448124/locations/global/workloadIdentityPools/prow-eks/*",
              + "serviceAccount:k8s-infra-prow-build.svc.id.goog[kubernetes-external-secrets/kubernetes-external-secrets]",
              + (known after apply),
            ]
          + role    = "roles/iam.workloadIdentityUser"
        }
    }

  # module.workload_identity_service_accounts["kubernetes-external-secrets"].google_service_account_iam_policy.serviceaccount_iam will be updated in-place
~ resource "google_service_account_iam_policy" "serviceaccount_iam" {
        id                 = "projects/k8s-infra-prow-build/serviceAccounts/kubernetes-external-secrets@k8s-infra-prow-build.iam.gserviceaccount.com"
      ~ policy_data        = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "principalSet://iam.googleapis.com/projects/773781448124/locations/global/workloadIdentityPools/prow-eks/*",
                          - "serviceAccount:k8s-infra-prow-build.svc.id.goog[kubernetes-external-secrets/kubernetes-external-secrets]",
                        ]
                      - role    = "roles/iam.workloadIdentityUser"
                    },
                ]
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra/gcp/terraform/k8s-infra-prow-build
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.k8s.io/lock?id=kubernetes%252Fk8s.io%252Finfra%252Fgcp%252Fterraform%252Fk8s-infra-prow-build%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra/gcp/terraform/k8s-infra-prow-build
  ```
Plan: 2 to add, 3 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```